{
  "backend/main.mo": "Defines the main canister actor with storage and authorization mixins, hardcoded admin credentials, session management, and many content-related data types.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing the purpose and behavior of numerous frontend files in the project.",
  "frontend/index.css": "Defines global Tailwind layers and OKLCH-based theme variables for light and dark mode styling.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, global providers, and the landing page layout with section components and admin pages.",
  "frontend/src/components/About.tsx": "Renders the bilingual About section with text, stats, icons, and fade‑in animations using the language context.",
  "frontend/src/components/admin/AccessDeniedScreen.tsx": "Displays an admin access-denied message with navigation buttons for home and login.",
  "frontend/src/components/admin/ContentBlocksManager.tsx": "Admin UI for creating content blocks with text, images, ordering, and visibility settings, including upload handling.",
  "frontend/src/components/admin/DiagnosticsPanel.tsx": "Runs a sequence of admin diagnostics including auth checks and CRUD tests on products, updating UI status for each step.",
  "frontend/src/components/admin/HowToOrderManager.tsx": "Manages creation and editing of How-To-Order steps with image uploads and form dialogs.",
  "frontend/src/components/admin/InstagramFeedManager.tsx": "Allows admins to configure Instagram feed settings including handle, embed code, titles, descriptions, and visibility.",
  "frontend/src/components/admin/PackagesManager.tsx": "Provides UI for listing, creating, editing, and deleting packages with image upload support.",
  "frontend/src/components/admin/ProductsManager.tsx": "Handles CRUD operations for products including editing details and uploading images via a dialog interface.",
  "frontend/src/components/admin/SectionsManager.tsx": "Admin UI for listing, creating, editing, and deleting content sections with image/background upload and visibility controls.",
  "frontend/src/components/admin/UserManagementPanel.tsx": "Admin interface to view existing admin users and create new ones via a dialog form.",
  "frontend/src/components/Contact.tsx": "A contact form component with name, email, and message fields that uses translations and displays a success toast on submit.",
  "frontend/src/components/DynamicSections.tsx": "Fetches and renders dynamically loaded sections and content blocks with multilingual text and optional background or images.",
  "frontend/src/components/Footer.tsx": "A footer with brand info, contact links, quick navigation buttons, and language-based text content.",
  "frontend/src/components/Header.tsx": "Sticky header with scroll detection, navigation buttons, mobile menu, language toggle, and admin navigation handling.",
  "frontend/src/components/Hero.tsx": "Hero section with background image, floating decorative elements, translated titles, and buttons that scroll to other sections.",
  "frontend/src/components/HowToOrder.tsx": "Displays a multi-step ordering guide using translated text and icons, with smooth-scroll to the contact section.",
  "frontend/src/components/InstagramFeed.tsx": "Fetches Instagram feed config and renders either an embed, profile link, or fallback message with localized text.",
  "frontend/src/components/Packages.tsx": "Shows a grid of predefined package cards with images, tags, and translated names/descriptions.",
  "frontend/src/components/Products.tsx": "Renders a large grid of product cards using static product data and localized fields.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides language state, translation function, and a large dictionary of English/Spanish UI strings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAdminSession.ts": "Handles admin session login, validation, and logout using the backend actor and session storage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, login flow, identity loading, and related state utilities.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, products, packages, and admin-related content via an actor API.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, dark mode theming, animations, and Instagram embed styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with Internet Identity and React Query providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders the admin dashboard UI with authentication checks, navigation, logout, and content-management panels.",
  "frontend/src/pages/AdminLogin.tsx": "Implements the admin login form with session validation, error handling, and navigation on success.",
  "frontend/src/utils/adminSessionStorage.ts": "Provides helpers to store, retrieve, and clear the admin session ID in localStorage.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them to sessionStorage, and cleaning parameters from the URL hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, theme extensions, custom colors, animations, and plugins.",
  "project_state.json": "Defines the project’s current plan to replace Internet Identity with custom username/password auth stored in Supabase, including admin‑only access, RLS rules, and pending feature requests. Lists existing features, known issues, and architectural notes guiding the migration."
}