{
  "backend/main.mo": "Defines the backend canister with storage, authorization, admin accounts, sessions, profile management, content blocks, sections, products, packages, and related data types.",
  "feature_evidence.json": "Provides feature evidence linking requirements to specific frontend files and components for background color theming and route-based styling.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files describing their function, UI behavior, and data integration.",
  "frontend/index.css": "Defines global Tailwind base styles and CSS variables for theme colors, radii, and dark mode behavior.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/ADMIN_ROUTES.md": "Documentation describing where admin routes are defined and listing the admin login and dashboard routes.",
  "frontend/src/App.tsx": "Sets up TanStack Router with root and admin routes, applies pink background to non-home pages, and wraps the app with language and toast providers.",
  "frontend/src/components/About.tsx": "Renders the About section with bilingual content, stats cards, icons, and animated fade‑in elements.",
  "frontend/src/components/admin/AccessDeniedScreen.tsx": "Provides an admin access‑denied UI with alert message, navigation buttons, and optional retry action.",
  "frontend/src/components/admin/ContentBlocksManager.tsx": "Admin tool to create content blocks, including forms, image upload handling, and section selection.",
  "frontend/src/components/admin/DiagnosticsPanel.tsx": "Runs a multi‑step admin diagnostic flow checking auth, product fetching, and CRUD ops with status updates. Uses test data and ExternalBlob images to validate backend functionality.",
  "frontend/src/components/admin/HowToOrderManager.tsx": "Manages creation and editing of How‑To‑Order steps with multilingual text and optional images. Provides a dialog for form input, image uploads, and sorted step display.",
  "frontend/src/components/admin/InstagramFeedManager.tsx": "Edits Instagram feed configuration including handle, embed code, multilingual titles/descriptions, visibility, and display order. Loads existing config and updates it via a mutation.",
  "frontend/src/components/admin/PackagesManager.tsx": "Provides CRUD management for package items with multilingual fields, pricing, and image uploads. Includes dialogs for editing/adding and confirmation for deletion.",
  "frontend/src/components/admin/ProductsManager.tsx": "Handles product CRUD with multilingual fields, pricing, and image uploads. Supports editing via a dialog and deleting via confirmation prompts.",
  "frontend/src/components/admin/SectionsManager.tsx": "Admin UI for listing, creating, editing, and deleting content sections with image uploads and visibility settings.",
  "frontend/src/components/admin/UserManagementPanel.tsx": "Admin panel to view, create, and manage admin users with a dialog-based user creation form.",
  "frontend/src/components/Contact.tsx": "Renders a localized contact form with name, email, and message fields, using toast notifications on submit. Includes icons, styling, and resets form state after submission.",
  "frontend/src/components/DynamicSections.tsx": "Fetches additional sections and displays visible ones with localized titles, descriptions, images, and content blocks. Supports background images and ordered rendering.",
  "frontend/src/components/Footer.tsx": "Displays brand info, quick navigation links with smooth scrolling, social links, and a button to download UI texts. Uses localized text and gradient styling.",
  "frontend/src/components/Header.tsx": "Provides a sticky header with scroll detection, navigation links, mobile menu support, and language toggle. Smooth-scrolls to sections and updates UI based on state.",
  "frontend/src/components/Hero.tsx": "Renders the landing hero section with background image, floating icons, localized titles, and CTA buttons. Includes smooth scrolling and decorative animations.",
  "frontend/src/components/HowToOrder.tsx": "Displays a multi‑step ordering guide with icons, translated text, and smooth scroll to the contact section.",
  "frontend/src/components/InstagramFeed.tsx": "Renders a configurable Instagram section with intersection animations, using either embed code or profile fallback.",
  "frontend/src/components/Packages.tsx": "Shows a grid of predefined package cards with images, tags, and translated names/descriptions.",
  "frontend/src/components/Products.tsx": "Displays a product catalog grid using static product metadata and translated labels.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides language state, persistence, and translation lookup for English and Spanish UI text.",
  "frontend/src/EDITING_TEXTS_AND_IMAGES_VIA_CHAT.md": "Explains where UI text and images are stored to support editing via chat.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAdminSession.ts": "Handles admin session login, validation with timeout, logout, and persistent session storage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, loading stored identities and providing login and logout utilities.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for interacting with backend data including products, packages, sections, users, and content.",
  "frontend/src/index.css": "Configures Tailwind layers, defines light/dark theme color variables, base styles, and custom utility classes including fade-in animations and Instagram embed styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, sets up React Query and Internet Identity provider, and renders the App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Implements the admin dashboard with authentication checks, loading and error states, and tabs for managing site content and users.",
  "frontend/src/pages/AdminLogin.tsx": "Provides the admin login form with session handling, actor initialization checks, and error feedback.",
  "frontend/src/texts/ui-texts.txt": "Contains all UI text keys with English and Spanish translations in a simple plain‑text format.",
  "frontend/src/texts/uiTextsSource.ts": "Exports the raw UI text file and filename for consistent translation loading and downloading.",
  "frontend/src/UI_TEXT_PLAIN_TEXT_WORKFLOW.md": "Describes the workflow for editing UI translations stored in a single plain‑text file.",
  "frontend/src/utils/adminSessionStorage.ts": "Provides helpers to store, retrieve, and clear the admin session ID in localStorage.",
  "frontend/src/utils/downloadUiTexts.ts": "Creates and triggers a browser download of the raw UI translations text file.",
  "frontend/src/utils/plainTextTranslations.ts": "Parses the plain‑text translation file into a key‑based object and provides a safe translation getter.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and persisting URL parameters, including session‑related values.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom color tokens, extended theme settings, animations, and typography/container/animate plugins.",
  "project_state.json": "Project metadata describing a request to apply a pink logo-derived background to all non-Home pages and noting the current black background issue."
}