{
  "backend/main.mo": "Defines actor with storage and authorization mixins, hardcoded admin data, session management, and extensive types for content, users, media, and UI sections.",
  "feature_evidence.json": "Feature evidence report linking a documentation-related feature to frontend/src/App.tsx with metadata, components, and test references.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing the purpose and behavior of various frontend components, hooks, context, and pages.",
  "frontend/index.css": "Global Tailwind base configuration defining color variables, dark mode overrides, and root-level styling.",
  "frontend/index.html": "Basic HTML entry file setting up root div and loading the main TypeScript module.",
  "frontend/src/ADMIN_ROUTES.md": "Documentation explaining where admin routes are defined and listing the login and dashboard route details.",
  "frontend/src/App.tsx": "Main router setup using TanStack Router, defining landing page and admin routes with LanguageProvider and Toaster integration.",
  "frontend/src/components/About.tsx": "Bilingual About section showing company story text and statistic cards with animated, styled visual elements.",
  "frontend/src/components/admin/AccessDeniedScreen.tsx": "Shows an access denied message for non-admin users with navigation buttons to home and admin login.",
  "frontend/src/components/admin/ContentBlocksManager.tsx": "Admin tool for creating content blocks with text, images, block type selection, ordering, and upload progress.",
  "frontend/src/components/admin/DiagnosticsPanel.tsx": "Runs admin diagnostics by checking auth, fetching products, and performing test CRUD operations with status updates.",
  "frontend/src/components/admin/HowToOrderManager.tsx": "Admin interface to add or edit 'How to Order' steps, including text fields, image uploads, and ordering.",
  "frontend/src/components/admin/InstagramFeedManager.tsx": "Provides a UI to view and update Instagram feed settings, including handle, embed code, titles, descriptions, order, and visibility.",
  "frontend/src/components/admin/PackagesManager.tsx": "Allows admins to create, edit, and delete packages with multilingual fields, pricing, and image upload support.",
  "frontend/src/components/admin/ProductsManager.tsx": "Enables managing products by adding, editing, or removing items with multilingual text, pricing, and image handling.",
  "frontend/src/components/admin/SectionsManager.tsx": "Manages additional landing page sections with multilingual content, order, visibility, and optional image/background uploads.",
  "frontend/src/components/admin/UserManagementPanel.tsx": "Displays admin users and provides a dialog to create new accounts with username, name, and password.",
  "frontend/src/components/Contact.tsx": "Bilingual contact form with validation, toast notifications, and display of contact info and social links.",
  "frontend/src/components/DynamicSections.tsx": "Fetches additional sections and renders visible ones with localized titles, descriptions, images, and content blocks.",
  "frontend/src/components/Footer.tsx": "Renders site footer with branding, contact info, social links, and scroll-based navigation.",
  "frontend/src/components/Header.tsx": "Provides a responsive header with scroll styling, navigation buttons, language toggle, and admin navigation.",
  "frontend/src/components/Hero.tsx": "Displays the hero section with background visuals, animated elements, localized text, and buttons that scroll to key sections.",
  "frontend/src/components/HowToOrder.tsx": "Shows a multi‑step ordering guide with icons and translations plus a button to scroll to the contact section.",
  "frontend/src/components/InstagramFeed.tsx": "Displays a configurable Instagram feed section with localization, intersection animations, and optional embed or profile link.",
  "frontend/src/components/Packages.tsx": "Displays a grid of predefined package items with translated titles, descriptions, images, and tags.",
  "frontend/src/components/Products.tsx": "Renders a list of product cards using translation keys, showing images, names, descriptions, and tags.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a language context with English/Spanish translations and a translation helper function.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing related queries when the actor changes.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin login sessions with validation, timeout handling, storage, and logout logic using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook for loading, storing, and managing user identities via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating products, packages, profiles, admin data, and other backend resources.",
  "frontend/src/index.css": "Configures Tailwind base styles, theme variables, dark mode, utility classes, and Instagram embed styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and renders the root component.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders the admin dashboard with session validation, error handling, logout flow, and tabs for managing products, packages, content, and diagnostics.",
  "frontend/src/pages/AdminLogin.tsx": "Provides the admin login form with session validation, error handling, actor checks, and redirects on successful login.",
  "frontend/src/utils/adminSessionStorage.ts": "Utility for reading, writing, and clearing the admin session ID from localStorage with error-safe access.",
  "frontend/src/utils/urlParams.ts": "Provides functions to read URL parameters, persist them in sessionStorage, and manage hash-based query parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins for the project’s styling system.",
  "project_state.json": "Metadata describing the project state, feature definitions, and configuration for project tracking."
}