{
  "backend/main.mo": "Defines the main canister actor with storage and authorization mixins plus types for content, users, products, packages, and site sections.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, related files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend files including components, pages, contexts, and hooks.",
  "frontend/index.css": "Tailwind base, components, and utilities setup with extensive light/dark theme CSS variables and global styling.",
  "frontend/index.html": "HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router and layout setup including landing page sections and admin login/dashboard routes.",
  "frontend/src/components/About.tsx": "Bilingual About section with statistics cards, icons, animations, and structured content.",
  "frontend/src/components/admin/AccessDeniedScreen.tsx": "Shows an access denied message with optional home navigation and link back to admin login.",
  "frontend/src/components/admin/ContentBlocksManager.tsx": "Admin tool for creating content blocks with text, images, ordering, and visibility settings for sections.",
  "frontend/src/components/admin/DiagnosticsPanel.tsx": "Runs diagnostic checks for authentication, admin status, product fetching, and product CRUD operations.",
  "frontend/src/components/admin/HowToOrderManager.tsx": "Admin interface to add or edit multilingual how‑to‑order steps with optional image uploads.",
  "frontend/src/components/admin/InstagramFeedManager.tsx": "Admin UI for viewing and updating Instagram feed settings including handle, embed code, titles, descriptions, visibility, and display order.",
  "frontend/src/components/admin/PackagesManager.tsx": "CRUD interface for managing packages with multilingual fields, pricing, image uploads, and edit/delete dialogs.",
  "frontend/src/components/admin/ProductsManager.tsx": "Admin tool for creating, editing, and deleting products with multilingual fields, pricing, and image upload support.",
  "frontend/src/components/admin/SectionsManager.tsx": "Manages additional page sections with multilingual text, visibility, order, and image/background uploads.",
  "frontend/src/components/Contact.tsx": "Contact form with bilingual labels, toast notifications, social/contact info, and form state handling.",
  "frontend/src/components/DynamicSections.tsx": "Renders dynamic, language-aware sections fetched from the backend, supporting backgrounds, images, and sortable content blocks.",
  "frontend/src/components/Footer.tsx": "Displays site footer with branding, contact info, social links, and scroll-based navigation using translation strings.",
  "frontend/src/components/Header.tsx": "Provides a responsive header with scrolling behavior, navigation links, language toggle, and admin access handling.",
  "frontend/src/components/Hero.tsx": "Shows the hero section with background imagery, animated elements, translated text, and buttons that scroll to other sections.",
  "frontend/src/components/HowToOrder.tsx": "Presents a translated step-by-step ordering guide with icons, cards, and a scroll-to-contact action.",
  "frontend/src/components/InstagramFeed.tsx": "Loads Instagram feed configuration to display an embed or profile link, with fade-in animation and language-aware text.",
  "frontend/src/components/Packages.tsx": "Displays a grid of predefined package cards with images and translated titles, descriptions, and tags.",
  "frontend/src/components/Products.tsx": "Renders a product gallery using a static product list, showing images and translated metadata in card layout.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a context for language selection and string translations between English and Spanish.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity context and provider for authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, admin status, products, and other backend-driven data using an actor.",
  "frontend/src/index.css": "Sets global Tailwind styles, theme variables, dark mode colors, animations, and Instagram embed styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with the QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page handling admin checks, profile setup, logout, and rendering various administrative management panels.",
  "frontend/src/pages/AdminLogin.tsx": "Admin login page using Internet Identity authentication with admin verification and conditional redirects.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL parameters and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom color system via CSS variables, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing project state, issues, and feature requests focused on fixing admin panel access and assigning admin roles based on Internet Identity principals."
}