{
  "backend/main.mo": "Defines the backend actor with storage and authorization mixins, admin/session management, and numerous types for content, profiles, products, and UI structures.",
  "feature_evidence.json": "Contains feature evidence entries linking feature IDs to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Lists summarized descriptions for many frontend files, detailing their roles and functionality.",
  "frontend/index.css": "Defines Tailwind base styles and color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry file loading the React application root and main script.",
  "frontend/src/ADMIN_ROUTES.md": "Explains where admin routes are defined and documents the /admin and /admin/login routes.",
  "frontend/src/App.tsx": "Sets up TanStack Router, language provider, layout components, and admin routes for the frontend app.",
  "frontend/src/components/About.tsx": "Renders the bilingual About section with animated stats, icons, and descriptive text.",
  "frontend/src/components/admin/AccessDeniedScreen.tsx": "Provides an access-denied UI for admins with navigation buttons and optional retry handling.",
  "frontend/src/components/admin/ContentBlocksManager.tsx": "Admin tool for creating content blocks with multilingual fields, optional image upload, and section assignment.",
  "frontend/src/components/admin/DiagnosticsPanel.tsx": "Runs a sequence of admin diagnostics including auth check, product fetch, and CRUD tests, updating status per step. Uses hooks to interact with product APIs and reports progress and errors.",
  "frontend/src/components/admin/HowToOrderManager.tsx": "Manages creation and editing of How-To-Order steps with form handling, image uploads, and dialog UI. Fetches existing steps, supports sorting, and updates backend via query hooks.",
  "frontend/src/components/admin/InstagramFeedManager.tsx": "Provides UI to edit Instagram feed settings such as handle, embed code, titles, descriptions, order, and visibility. Loads config via hooks and saves updates through a mutation.",
  "frontend/src/components/admin/PackagesManager.tsx": "CRUD manager for packages with form inputs, image upload handling, and confirmation dialogs. Fetches all packages and supports add, edit, and delete operations via query hooks.",
  "frontend/src/components/admin/ProductsManager.tsx": "Admin interface for managing products including add, edit, delete, image uploads, and validation. Uses product query hooks to load data and perform mutations.",
  "frontend/src/components/admin/SectionsManager.tsx": "Admin UI for listing, creating, editing, and deleting content sections with image uploads and visibility settings.",
  "frontend/src/components/admin/UserManagementPanel.tsx": "Admin panel for viewing existing admin users and creating new ones through a modal form.",
  "frontend/src/components/Contact.tsx": "Contact form component with localized fields, form state handling, and toast-based success feedback.",
  "frontend/src/components/DynamicSections.tsx": "Fetches and renders dynamic, language-aware sections with optional backgrounds, images, and content blocks.",
  "frontend/src/components/Footer.tsx": "Footer with branding, contact info, navigation shortcuts, social links, and a UI text download action.",
  "frontend/src/components/Header.tsx": "Sticky header with scroll detection, navigation links, mobile menu, and language toggle.",
  "frontend/src/components/Hero.tsx": "Hero section with background image, floating icons, localized titles, and CTA buttons linking to other sections.",
  "frontend/src/components/HowToOrder.tsx": "Displays a multi-step ordering guide with icons and translations, including smooth scroll to a contact section.",
  "frontend/src/components/InstagramFeed.tsx": "Renders an Instagram feed section using admin-configured embed code or handle, with language-based text and intersection animations.",
  "frontend/src/components/Packages.tsx": "Shows a grid of predefined product packages with images, tags, and translated names and descriptions.",
  "frontend/src/components/Products.tsx": "Displays a large grid of predefined product items with images, tags, and translated text.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a language context with translation lookup, storing the selected language in localStorage.",
  "frontend/src/EDITING_TEXTS_AND_IMAGES_VIA_CHAT.md": "Brief guide describing where UI text and images are stored for chat-based editing.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAdminSession.ts": "Handles admin session login, validation with timeout, logout, and persistent session storage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login flow, stored identities, and exposes identity state through context.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend operations for user profiles, admin actions, products, packages, sections, and other content.",
  "frontend/src/index.css": "Tailwind base and utility layers plus light/dark theme CSS variables and a fade‑in animation class.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard handling session validation, loading/error states, and navigation to various admin management panels.",
  "frontend/src/pages/AdminLogin.tsx": "Login form for admin users with actor initialization handling and error feedback.",
  "frontend/src/texts/ui-texts.txt": "Plain text file containing English and Spanish UI strings keyed for translation.",
  "frontend/src/texts/uiTextsSource.ts": "Loads the raw UI text file for use in translation features and downloads.",
  "frontend/src/UI_TEXT_PLAIN_TEXT_WORKFLOW.md": "Documentation describing the plain‑text translation file workflow and how users can download it from the UI.",
  "frontend/src/utils/adminSessionStorage.ts": "Utility for storing, retrieving, and clearing the admin session ID in localStorage.",
  "frontend/src/utils/downloadUiTexts.ts": "Generates a downloadable file of the raw UI translations using a Blob and temporary URL.",
  "frontend/src/utils/plainTextTranslations.ts": "Parses the plain‑text translation file into a key‑based object and provides a translation lookup helper.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL parameters, persisting them in sessionStorage, and managing hash‑based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, layout, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project's state, including metadata, existing feature definitions, and workflow settings for a translation-download feature."
}