{
  "backend/main.mo": "Motoko backend defining state, authorization mixins, and extensive content-related types for sections, products, blocks, images, and admin updates.",
  "feature_evidence.json": "Feature evidence report listing feature descriptions, related files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing their roles in UI, admin features, routing, and content management.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color palettes and applying global background and text styles.",
  "frontend/index.html": "Basic HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, global providers, and landing page layout with all major sections and admin pages.",
  "frontend/src/components/About.tsx": "About section component showing bilingual content, statistics cards, icons, and fade‑in animations.",
  "frontend/src/components/admin/ContentBlocksManager.tsx": "Admin tool for creating content blocks with text, images, ordering, visibility, and section assignment.",
  "frontend/src/components/admin/DiagnosticsPanel.tsx": "Admin diagnostic panel that tests auth, admin status, product fetching, and CRUD operations with detailed step results.",
  "frontend/src/components/admin/HowToOrderManager.tsx": "Admin UI for listing, creating, and editing How-To-Order steps with image upload and progress tracking.",
  "frontend/src/components/admin/InstagramFeedManager.tsx": "Form-based admin tool to configure Instagram feed settings including handle, embed code, titles, descriptions, visibility, and order.",
  "frontend/src/components/admin/PackagesManager.tsx": "Admin interface for managing packages, supporting create, edit, delete, and image uploads.",
  "frontend/src/components/admin/ProductsManager.tsx": "Admin tool to add, edit, and delete products with fields for multilingual text, pricing, and image upload.",
  "frontend/src/components/admin/SectionsManager.tsx": "Admin management UI for custom sections with multilingual text, visibility toggles, ordering, and image/background uploads.",
  "frontend/src/components/Contact.tsx": "A contact form component with localized labels, input handling, and a success toast on submit.",
  "frontend/src/components/DynamicSections.tsx": "Fetches and renders customizable, ordered sections and blocks with localization and optional backgrounds.",
  "frontend/src/components/Footer.tsx": "Displays brand info, quick navigation links, and contact details using localized text.",
  "frontend/src/components/Header.tsx": "A responsive header with scroll behavior, navigation links, language toggle, and admin access logic.",
  "frontend/src/components/Hero.tsx": "A full‑screen hero section with background image, floating icons, localized text, and CTA buttons.",
  "frontend/src/components/HowToOrder.tsx": "Renders a multi-step 'How to Order' section with icons, translations, and scroll-to-contact behavior.",
  "frontend/src/components/InstagramFeed.tsx": "Displays an Instagram section using admin-configured embed code or handle, with language-based text and intersection animations.",
  "frontend/src/components/Packages.tsx": "Shows a grid of package cards with images, tags, and translated titles and descriptions.",
  "frontend/src/components/Products.tsx": "Lists product cards with images, tags, and translated names and descriptions in a responsive grid.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a React context for language selection and string translations between English and Spanish.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, logout, stored identity loading, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, admin status, products, and related backend resources.",
  "frontend/src/index.css": "Defines global Tailwind-based styles, CSS variables, dark mode themes, and utility classes like fade-in animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider before rendering the main App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Renders the admin dashboard, handling authentication, admin checks, profile setup, navigation, and loading states.",
  "frontend/src/pages/AdminLogin.tsx": "React page handling Internet Identity login, admin-status checks, and an optional bootstrap flow to assign the current user the admin role.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and clearing them from hashes.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions, color tokens, animations, and plugins.",
  "project_state.json": "Metadata describing project state, architecture notes, known issues, and feature requirements for restoring and stabilizing the app."
}