{
  "kind": "build_request",
  "title": "Fix admin panel access and grant admin role to hernan@zerma-la.com (principal ix7jl-…-6ae)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Guarantee that the Internet Identity principal `ix7jl-xlknv-uwyet-3fsxh-x7nqh-zkhvg-keqsk-zs4hv-ihh5p-uytti-6ae` (user email reference: `hernan@zerma-la.com`) is granted admin privileges in the backend so that this user can access the admin dashboard.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "revisa que el panel admin funcione correctamente y agrega a hernan@zerma-la.com como admin"
        ]
      },
      "acceptanceCriteria": [
        "Calling the backend admin-check method (used by the frontend `useIsCallerAdmin` hook) returns `true` for principal `ix7jl-xlknv-uwyet-3fsxh-x7nqh-zkhvg-keqsk-zs4hv-ihh5p-uytti-6ae`.",
        "Admin-only backend methods (e.g., product CRUD) succeed for this principal and continue to reject non-admin principals.",
        "If the canister is upgraded and existing state is present, the change is applied without wiping existing content/state (profiles/products/packages/sections/etc.)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Review and fix the admin panel end-to-end flow so it works reliably: Internet Identity login, admin role check, navigation to `/admin`, and a clear non-admin experience without silent loops or no-op behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "revisa que el panel admin funcione correctamente"
        ]
      },
      "acceptanceCriteria": [
        "After logging in with Internet Identity as an admin, the app navigates to `/admin` and renders the Admin Dashboard (no blank screen).",
        "If a logged-in user is not an admin, `/admin` and `/admin/login` show a clear message indicating access is denied (and do not get stuck in a redirect loop).",
        "The Admin Diagnostics panel can be executed by an admin without errors and completes product CRUD validation successfully (create/read/update/delete of the temporary test product)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "If the project currently supports a 'bootstrap admin' action from the Admin Login page, ensure it fails gracefully with a clear error message when unauthorized, and ensure it is not required for the configured admin principal in REQ-1 to access the admin dashboard.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "revisa que el panel admin funcione correctamente y agrega a hernan@zerma-la.com como admin"
        ]
      },
      "acceptanceCriteria": [
        "When the bootstrap action is unauthorized, the UI shows an actionable error message (no silent failure) and remains on the same page.",
        "For principal `ix7jl-xlknv-uwyet-3fsxh-x7nqh-zkhvg-keqsk-zs4hv-ihh5p-uytti-6ae`, the bootstrap option is not needed to access `/admin` (admin is recognized via backend role configuration)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no new backend services).",
    "Only add `backend/migration.mo` changes if needed to preserve/upgrade existing stable state; follow the conditional migration policy.",
    "Do not modify any files under `frontend/src/components/ui` or any paths listed as immutable in SYSTEM_CONTEXT (compose instead).",
    "Use English for any user-facing text added/changed in the UI."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity).",
    "Adding external databases or non-IC storage systems.",
    "Building real-time features (WebSockets/push notifications/chat)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}