{
  "kind": "build_request",
  "title": "Apply AABoxes logo pink background to all non-Home pages (fix black background)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Extract the primary pink color from the uploaded AABoxes logo screenshot (image-12.png) and define it as a reusable theme token (e.g., a CSS custom property or Tailwind-safe variable) that can be applied as a page background color.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "1. Extraelo del logo"
        ]
      },
      "acceptanceCriteria": [
        "A single canonical \"AABoxes pink\" color token exists in the frontend styling system.",
        "The chosen pink is sampled from image-12.png (not manually substituted with an unrelated pink)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Set the application background to the extracted AABoxes pink on every route/page except the Home (\"Inicio\") route ('/'). The Home route must keep its current background behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "2. confirmado",
          "hazlo del color rosado que tiene el logo de AABoxes. En todas las paginas excepto el Inicio"
        ]
      },
      "acceptanceCriteria": [
        "Visiting '/' (Home) keeps the current background styling (no forced pink page background applied globally).",
        "Visiting '/admin/login' uses the extracted AABoxes pink as the page background (no black background visible).",
        "Visiting '/admin' uses the extracted AABoxes pink as the page background (no black background visible).",
        "No route shows an unintended black background as a result of this change."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/immutablePaths (e.g., frontend/src/main.tsx, frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/components/ui)."
  ],
  "nonGoals": [
    "Do not change UI text/translations.",
    "Do not change backend logic or data models."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}