{
  "kind": "build_request",
  "title": "Restore backend + Internet Identity auth and fully working admin-only product management",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Restore Internet Identity (II) as the primary authentication method and ensure the frontend uses an authenticated backend actor after login (no anonymous/placeholder actor for admin actions). Admin routes must reliably redirect unauthenticated users to the Admin Login page and prevent access when authentication is missing.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Authentication & Backend: Re-integrate the backend services and restore Internet Identity (II) Authentication as the primary login method."
        ]
      },
      "acceptanceCriteria": [
        "Visiting /admin while logged out redirects to /admin/login.",
        "Clicking “Login with Internet Identity” successfully authenticates and returns the user to /admin for authorized accounts.",
        "After login, backend calls used by the admin panel (e.g., isCallerAdmin, product CRUD) are executed with the logged-in identity (no anonymous identity).",
        "Logging out clears the II session and React Query cache and returns the user to the public site."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Restore the Admin Panel to its previously functional state by ensuring all existing admin UI modules load and operate correctly (Dashboard, tabs, managers, dialogs) without runtime errors and with correct data fetching/mutations via React Query.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Admin Panel Restoration: Revert the Admin Panel to its previous functional state. Ensure all original UI components and logic are intact."
        ]
      },
      "acceptanceCriteria": [
        "Admin Dashboard loads successfully for an authorized admin without blank screen or uncaught exceptions.",
        "All existing admin tabs render their manager components (Products, Packages, How to Order, Instagram, Sections, Content Blocks).",
        "Each manager can fetch its data and perform its save/update/delete operations (subject to authorization) and refreshes UI state after mutations.",
        "User-facing admin messages remain in English (e.g., errors/toasts, labels, buttons)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement an admin-permissions bootstrap flow to set up an Admin Principal for the Internet Identity account associated with hernan@zerma-la.com. Because the backend only receives Principals (not emails), provide a safe way to register the first/desired admin Principal after that user logs in with II, and persist that Principal in backend authorization state so subsequent sessions are recognized as admin.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Permissions: Set up an Admin Principal user using the identity linked to: hernan@zerma-la.com."
        ]
      },
      "acceptanceCriteria": [
        "There is a clear, in-app way to bind the logged-in Principal (from the II session that the user knows is hernan@zerma-la.com) as an admin Principal (e.g., “Make this Principal Admin” gated by an explicit bootstrap rule).",
        "After admin bootstrap, isCallerAdmin returns true for that Principal across page reloads and future logins.",
        "Non-admin Principals cannot grant themselves admin privileges.",
        "Admin authorization state persists across canister upgrades according to the project’s existing authorization/mixin storage approach."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure Product Editing (create, update, delete, and list) is fully operational end-to-end and strictly restricted to Admin role at the backend boundary (all product mutations must trap/deny for non-admin callers).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Product Management: Ensure the \"Product Editing\" functionality is fully operational and restricted to the Admin role."
        ]
      },
      "acceptanceCriteria": [
        "Admin can create a product with bilingual title/description, price, and image upload; the new product appears in the admin list and public product display where applicable.",
        "Admin can edit an existing product (including optionally keeping existing image) and see updates reflected after save.",
        "Admin can delete a product and it is removed from subsequent fetches.",
        "Non-admin users attempting add/edit/delete receive an authorization error from the backend and no mutation occurs."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add a diagnostic/verification workflow to validate stability of (1) Internet Identity authentication flow, (2) admin authorization check, and (3) product CRUD operations against the backend. Expose results as a simple pass/fail report accessible from the Admin Panel.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Verification: Run a diagnostic check on the authentication flow and the database CRUD operations for products to ensure stability."
        ]
      },
      "acceptanceCriteria": [
        "Admin UI includes a “Diagnostics” section that runs checks and displays clear results in English.",
        "Diagnostics verifies: current authentication state (logged-in Principal present), isCallerAdmin result, and successful product list fetch.",
        "Diagnostics can perform a safe CRUD validation cycle (e.g., create a temporary test product, verify it exists, update it, verify update, delete it, verify removal) without leaving orphaned test data.",
        "If any step fails, the UI reports which step failed and includes the error message returned by the backend."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files in frontend immutablePaths (compose existing hooks/components instead of modifying those files).",
    "Use English for all user-facing text in admin/auth/diagnostics UI."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity).",
    "Integrating external databases or off-chain storage services.",
    "Real-time features (websockets/push)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}