{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Apply AABoxes pink background on all non-Home routes",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Sample the primary pink from image-12.png and add a single reusable theme token for it in the styling system.",
      "acceptanceCriteria": [
        "A single canonical \"AABoxes pink\" color token exists in the frontend styling system.",
        "The chosen pink is sampled from image-12.png (not manually substituted with an unrelated pink)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add a canonical CSS custom property token (e.g., --aaboxes-pink) under :root (and ensure it’s available regardless of dark mode). The value must be sampled directly from the uploaded image-12.png using a color picker/eyedropper, then stored as the single source-of-truth token."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Expose the AABoxes pink token as a Tailwind color (e.g., aaboxesPink mapped to the CSS variable) so it can be applied consistently via utility classes across pages."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Apply the AABoxes pink background on every route except Home ('/'), ensuring admin routes do not show black backgrounds.",
      "acceptanceCriteria": [
        "Visiting '/' (Home) keeps the current background styling (no forced pink page background applied globally).",
        "Visiting '/admin/login' uses the extracted AABoxes pink as the page background (no black background visible).",
        "Visiting '/admin' uses the extracted AABoxes pink as the page background (no black background visible).",
        "No route shows an unintended black background as a result of this change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the root layout to conditionally apply the AABoxes pink background on all non-Home routes based on the current pathname while leaving '/' unchanged. Ensure the wrapper sets a full-page background (min height) so underlying black is never visible."
        },
        {
          "path": "frontend/src/pages/AdminLogin.tsx",
          "operation": "modify",
          "description": "Remove/adjust page-level background classes (including dark gradients) so the page inherits the non-Home route background from the root layout token, ensuring no black background appears on '/admin/login'."
        },
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Remove/adjust page-level background classes (including dark gradients) so the page inherits the non-Home route background from the root layout token, ensuring no black background appears on '/admin'."
        }
      ]
    }
  ]
}