{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Repair admin panel flow (II login, role check, /admin access) and improve bootstrap admin UX",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Fix the admin panel end-to-end flow so admins reliably reach /admin and non-admins see a clear access denied experience without loops or blank screens.",
      "acceptanceCriteria": [
        "After logging in with Internet Identity as an admin, the app navigates to `/admin` and renders the Admin Dashboard (no blank screen).",
        "If a logged-in user is not an admin, `/admin` and `/admin/login` show a clear message indicating access is denied (and do not get stuck in a redirect loop).",
        "The Admin Diagnostics panel can be executed by an admin without errors and completes product CRUD validation successfully (create/read/update/delete of the temporary test product)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Harden actor initialization so admin-panel queries don't fail due to secret-based access-control initialization (e.g., wrap the access-control initialization call in safe error handling, and ensure the actor is still returned for authenticated sessions). This improves reliability for admin checks and admin diagnostics."
        },
        {
          "path": "frontend/src/components/admin/AccessDeniedScreen.tsx",
          "operation": "create",
          "description": "Create a reusable admin access denial UI (clear English messaging + primary/secondary actions) for use on /admin and /admin/login. Use shadcn-ui components (Card/Alert/Button) to keep styling consistent. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Remove blank-screen behavior when not authenticated or not admin. Replace redirect-only behavior with explicit UI states: (1) not authenticated -> render a clear sign-in required message with a button to `/admin/login`; (2) authenticated but not admin -> render AccessDeniedScreen without redirect loops; (3) authenticated admin -> render dashboard as before. Use the new AccessDeniedScreen (shadcn-ui composition). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminLogin.tsx",
          "operation": "modify",
          "description": "Ensure /admin/login provides a clear, stable UX: after successful II login and admin recognition, navigate to `/admin`; for authenticated non-admins, render an explicit AccessDeniedScreen message instead of silent/no-op states. Keep navigation stable to avoid loops. Use AccessDeniedScreen (shadcn-ui composition). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure any admin bootstrap action from Admin Login fails gracefully with clear messaging when unauthorized and is not required for the configured admin principal to access /admin.",
      "acceptanceCriteria": [
        "When the bootstrap action is unauthorized, the UI shows an actionable error message (no silent failure) and remains on the same page.",
        "For principal `ix7jl-xlknv-uwyet-3fsxh-x7nqh-zkhvg-keqsk-zs4hv-ihh5p-uytti-6ae`, the bootstrap option is not needed to access `/admin` (admin is recognized via backend role configuration)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a dedicated React Query mutation hook for the backend bootstrap admin capability (calling the existing backend method exposed in the typed interface). Ensure errors are surfaced as meaningful Error messages for UI display, and invalidate the cached admin-check query on success so the UI updates immediately."
        },
        {
          "path": "frontend/src/pages/AdminLogin.tsx",
          "operation": "modify",
          "description": "Update the bootstrap-admin UI flow to use the dedicated bootstrap mutation hook. When unauthorized or failing, show a clear, actionable English error message inline (in-page) and do not navigate away. Also ensure the bootstrap option is not presented/needed once the backend recognizes the user as admin (i.e., when isAdmin becomes true, the page should route to `/admin`). Use shadcn-ui Alert components for inline error display. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}